Repository: 10up/simple-local-avatars
Catalog: localization/simple-local-avatars-*.po
Languages: be_by, hu_hu

source: Local Avatar Permissions
be_by: Лакальныя налады аватара
hu_hu: Lokális profilkép engedélyek

source: Only allow users with file upload capabilities to upload local avatars (Authors and above)
be_by: Толькі карыстачы вызначанай катэгорыі могуць загружаць аватары (Аўтары і вышэй)
hu_hu: Csak azok a felhasználók tölthessenek fel saját avatárt, akik fájlokat is tölthetnek fel (Szerzők, vagy magasabb jogosultsági szintűek)

source: Avatar
be_by: Аватар
hu_hu: Profilkép

source: Upload Avatar
be_by: Загрузіць аватар
hu_hu: Profilkép feltöltése

source: No local avatar is set. Use the upload field to add a local avatar.
be_by: Няма установленого лакальнага аватара. Выкарыстоўвайце загрузку, каб дадаць аватар.
hu_hu: Még nincs profilkép feltöltve. Saját profilkép hozzáadásához használd a feltöltés mezőt!

source: Delete local avatar
be_by: Выдаліць лакальны аватар
hu_hu: Profilkép törlése

source: Replace the local avatar by uploading a new avatar, or erase the local avatar (falling back to a gravatar) by checking the delete option.
be_by: Замяніць лакальны аватар загрузіўшы новы малюнак ці сцерці лакальны аватар пазначыўшы опцыю выдалення. (па змаўчанні вернецца gravatar)
hu_hu: A meglévő profilkép lecserélhető egy új profilkép feltöltésével, vagy a meglévő törlésével (ekkor a gravatar képed lesz használva), ha bepipálod a törlés mezőt.

source: No local avatar is set. Set up your avatar at Gravatar.com.
be_by: Лакальны аватар не ўсталяваны. Усталяваць ваш аватар на Gravatar.com
hu_hu: Nincs lokális profilképed. Állíts be magadnak egy profilképet a Gravatar.com oldalon!

source: You do not have media management permissions. To change your local avatar, contact the blog administrator.
be_by: Вашых паўнамоцтваў не досыць для змены аватара. Каб змяніць лакальны аватар, звяжыцеся з адміністратарам сайта.
hu_hu: Nincs médiafájl-kezelési jogosultságod! A profilképed megváltoztatásához meg kell keresned az oldal valamelyik adminisztrátorát.

source: Simple Local Avatars
be_by: Лакальны аватар
hu_hu: Egyszerű helyi profilképek

source: Adds an avatar upload field to user profiles if the current user has media permissions. Generates requested sizes on demand just like Gravatar! Simple and lightweight.
be_by: Дадаць запампоўку аватара да профіля карыстача, калі ў бягучага карыстача ёсць паўнамоцтвы. Генераваць такія ж памеры, як на Gravatar-е. Проста і лёгка.
hu_hu: A felhasználói profilhoz hozzáad egy profilkép feltöltése mezőt, ha a felhasználónak van médiakezelési jogosultsága. A szükséges képméreteket éppúgy legenerálja, mint a Gravatar. Egyszerű és pehelykönnyű.
